perf/tests/auth-test.yml
config:
  target: "http://localhost:8000"
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://localhost:9091"
        tags:
          - "test_id:status_list_auth"
    expect: {}
    ensure: {}
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up - 10 users"
    - duration: 120
      arrivalRate: 25
      name: "Ramp up - 50 users"
    - duration: 180
      arrivalRate: 50
      name: "Peak load - 100 users"
    - duration: 120
      arrivalRate: 25
      name: "Scale down - 50 users"
    - duration: 60
      arrivalRate: 0
      name: "Cool down"

  processor: "../scripts/processor.js"

  # The issuer is registered once before the run by scripts/setup.js (invoked by
  # `npm run test:auth*`). Registration used to run as a low-weight scenario
  # alongside the authenticated flows; until it landed, every authenticated
  # request returned 401.

  ensure:
    maxErrorRate: 5 # Max 5% error rate (excluding expected 401s)
    p95: 2000 # 95th percentile < 2s

scenarios:
  - name: "Authenticated Publish Flow"
    weight: 40
    flow:
      - function: "loadTestData"
      - function: "selectRandomToken"
      - function: "generateUUID"
      - put:
          url: "/api/v1/status-lists/{{ listId }}/statuses"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            statuses:
              - index: 1
                status: 0
              - index: 2
                status: 1
              - index: 3
                status: 2
          expect:
            - statusCode: 201
          afterResponse: "handlePublishResponse"
      - think: 1

  - name: "Authenticated Update Flow"
    weight: 40
    flow:
      - function: "loadTestData"
      - function: "selectRandomToken"
      - function: "generateUUID"
      # First publish
      - put:
          url: "/api/v1/status-lists/{{ listId }}/statuses"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            statuses:
              - index: 1
                status: 0
          expect:
            - statusCode: 201
          afterResponse: "handlePublishResponse"
      # Then update
      - think: 0.5
      - patch:
          url: "/api/v1/status-lists/{{ listId }}/statuses"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            statuses:
              - index: 1
                status: 1
              - index: 2
                status: 0
          expect:
            - statusCode: 200
          afterResponse: "handleUpdateResponse"
      - think: 1

  - name: "Test Unauthorized Access (Expected 401)"
    weight: 15
    flow:
      - function: "generateUUID"
      - put:
          url: "/api/v1/status-lists/{{ listId }}/statuses"
          # NO Authorization header
          json:
            statuses:
              - index: 0
                status: 0
          expect:
            - statusCode: 401 # Expected!
          afterResponse: "handleUnauthorizedResponse"
      - think: 1